read_verilog alu4.v
synth -flatten; opt; dffunmap; abc -g AND
write_aiger -ascii input_graph.aag
